Show / Hide Table of Contents
Enum SupportType
Types of support
Namespace: IdeaRS.OpenModel.Concrete
Assembly: IdeaRS.OpenModel.dll
Syntax
[Flags]
public enum SupportType
Fields
 Name |  Description
 Hinge
Hinge type
 HingeHinge
Combination of hinge and hinge
 HingeNoSupport
Combination of hinge and nosupport
 NoSupport
Without support
 Rigid
Rigid type
 RigidHinge
Combination of rigid and hinge
 RigidNoSupport
Combination of rigid and nosupport
 RigidRigid
Combination of rigid and rigid
 Improve this Doc
 View Source